# Mac GUI apps/casks

brew "mas"
brew "mackup"
mas "Amphetamine", id: 937984704
cask "geekbench"
cask "1password"
mas "1Password for Safari", id: 1569813296
cask "1password-cli"
cask "bettertouchtool"
cask "vlc"
# always tries to reinstall so comment out after initial install on Mac
mas "1Blocker", id: 1365531024
mas "BBEdit", id: 404009241
mas "Copy 'Em", id: 876540291
mas "Drafts", id: 1435957248
mas "Speedtest", id: 1153157709
mas "StopTheMadness", id: 1376402589
mas "The Unarchiver", id: 425424353
mas "Hush", id: 1544743900
mas "Mobile Mouse Server", id: 412814284
mas "Moom", id: 419330170
cask "visual-studio-code"
cask "mission-control-plus"
cask "firefox"
cask "google-chrome"
cask "betterzip"
cask "forklift"
cask "transmission"
cask "appcleaner"
# QuickLook plugin for source code with syntax highlighting.
cask "qlcolorcode"
# QuickLook plugin that lets you view plain text files without a file extension
cask "qlstephen"
cask "carbon-copy-cloner"
cask "cheatsheet"
cask "customshortcuts"
cask "hazel"
cask "raycast"
cask "downie"
cask "jdownloader"
mas "PopClip", id: 445189367
cask "bunch"
cask "keyboard-maestro"
cask "transmit"
cask "markdown-service-tools"
mas "The Magic Highlighter", id: 1663033087
mas "ColorSlurp", id: 1287239339
mas "Super Agent for Safari", id: 1568262835
# Current favorite DBMS interface
cask "tableplus"
cask "nteract"
mas "Short Circuit: AI Assistant", id: 1638522784
cask "obsidian"
cask "typora"
mas "Cardhop", id: 1290358394
mas "Acorn", id: 1547371478
mas "Actions", id: 1586435171
mas "Dark Reader for Safari", id: 1438243180
mas "Vinegar", id: 1591303229
mas "Baking Soda", id: 1601151613
cask "font-menlo-for-powerline"
cask "arc"
cask "cyberduck"
cask "paletro"
cask "signal"
cask "tigervnc-viewer"
mas "Transmit", id: 1436522307
mas "Screens 5", id: 1663047912
mas "Tailscale", id: 1475387142
cask "hookmark"
cask "latest"
cask "screens-connect"
cask "balenaetcher"
# Use the non-Mac-App-Store version - it has more features.
cask "daisydisk"
mas "Mactracker", id: 430255202
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
cask "gimp"
cask "audacity"
# Reverse proxy, secure introspectable tunnels to localhost
cask "ngrok"


#==============================================================================
#                       Personal
#==============================================================================
# For personal machines, in addition to core
cask "textexpander"
mas "TaskPaper", id: 1090940630
mas "Things", id: 904280696
mas "MultiMarkdown Composer", id: 1275176220
mas "Expressions", id: 913158085
mas "The Camelizer", id: 1532579087
mas "DuckDuckGo", id: 663592361
mas "Deliveries", id: 290986013
mas "Fantastical", id: 975937182
mas "GarageBand", id: 682658836
# always tries to reinstall so comment out after initial install on Mac
mas "Highlights", id: 1498912833
mas "Pastel", id: 413897608
# More of a regular desktop app? Not plex-media-server.
cask "plex"
# More of a TV/10-ft interface? Not plex-media-server.
cask "plex-media-player"
mas "iMovie", id: 408981434
mas "Play", id: 1596506190
mas "Keynote", id: 409183694
mas "Kindle", id: 405399194
mas "Notability", id: 360593530
mas "OmniOutliner", id: 1142578772
mas "Scapple", id: 568020055
mas "Noizio", id: 928871589
# always tries to reinstall so comment out after initial install on Mac
mas "Prime Video", id: 545519333
cask "foldingtext"
cask "xee"
cask "inkscape"
cask "iina"
cask "swiftdefaultappsprefpane"
cask "google-earth-pro"
mas "Forecast Bar", id: 982710545
# TODO: Which one do I want?
mas "MusicBar", id: 6447295161
cask "music-bar"
cask "drawio"
cask "notion"
mas "Notion Web Clipper", id: 1559269364
cask "fastscripts"
mas "Paprika Recipe Manager 3", id: 1303222628
mas "WriteRoom", id: 417967324
mas "Simplenote", id: 692867256
mas "Poolsuite FM", id: 1514817810
mas "Dark Noise", id: 1465439395
cask "discord"
cask "tinderbox"
cask "default-folder-x"
mas "Backtrack", id: 1477089520
# Install failed
mas "Overcast", id: 888422857
# TODO: Choosy or openIn?
cask "choosy"
cask "zotero"
cask "bike"
cask "karabiner-elements"
mas "Data Jar", id: 1453273600
mas "DuckDuckGo Privacy for Safari", id: 1482920575
mas "MacFamilyTree 10", id: 1567970985
mas "FamilySearch Tree", id: 885982973
mas "Drone Buddy: Fly Drone Safely", id: 992303145
mas "Home Assistant", id: 1099568401
mas "Save to Reader", id: 1640236961
mas "Lensa", id: 1436732536
mas "Actions for Obsidian", id: 1659667937
mas "Timery", id: 1425368544
mas "Toggl Track", id: 1291898086
mas "Streaks", id: 963034692
mas "Portal", id: 1436994560
mas "Banktivity", id: 1480779512
cask "micro-snitch"
cask "little-snitch"
mas "Flighty - Live Flight Tracker", id: 1358823008
mas "Battery Health", id: 490192174
mas "Disk Diag", id: 672206759
mas "AllMyBatteries", id: 1621263412
cask "element"
cask "firefox-developer-edition"
mas "Kindle", id: 302584613
mas "Ice Cubes", id: 6444915884
mas "MarkDownload - Markdown Web Clipper", id: 1554029832
cask "sirimote"
mas "Meshtastic", id: 1586432531
cask "mullvad-browser"
cask "qgis"
cask "dropzone"
cask "pearcleaner"

#             Other Fonts
#------------------------------------------------------------------------------
cask "font-hack-nerd-font"
cask "font-fontawesome"

#==============================================================================
#                       Other
#==============================================================================
cask "zoom"
mas "Studies", id: 1071676469
mas "Be Focused Pro", id: 961632517
mas "Omnivore", id: 1564031042
mas "Friendly Streaming", id: 553245401
mas "Koi Pond 3D Lite", id: 534867956
# Apple TV Aerial screensaver
cask "aerial"
# GUI for homebrew
cask "cakebrew"
mas "Bluesky Social", id: 6444370199
mas "Fotor Photo Editor", id: 503039729
# Paid - use handbrake normally
cask "permute"
cask "houdahspot"
cask "logitech-g-hub"
cask "onyx"
cask "textsniper"
mas "Save to Raindrop.io", id: 1549370672
mas "Vimeo", id: 1356686763
cask "meld"
cask "rclone-browser"
mas "Slack", id: 803453959
mas "PCalc", id: 403504866
cask "yacreader"
mas "Simple Comic", id: 1497435571
cask "visual-studio-code@insiders"
cask "duet"
mas "Yomu", id: 562211012
cask "chatgpt"
mas "Perplexity", id: 6714467650
cask "claude"
cask "qlmarkdown"
mas "Canva", id: 897446215
mas "Craft", id: 1487937127
mas "Fakespot", id: 1592541616
mas "Blackmagic Disk Speed Test", id: 425264550
cask "github"
cask "anythingllm"
cask "bruno"
cask "handbrake-app"
cask "httpie-desktop"
cask "mullvad-vpn"
mas "Obsidian Web Clipper", id: 6720708363
mas "uBlock Origin Lite", id: 6745342698
cask "krita"
cask "quit-all"
cask "shortcutdetective"
mas "Bitwarden", id: 1352778147
mas "Copilot", id: 6738511300
mas "Eter Radio", id: 1523221566
mas "MarkChart", id: 6475648822
mas "Read Aloud", id: 6747257186
cask "linear-linear"
cask "miro"
cask "frame0"
cask "ghostty"
mas "GrandPerspective", id: 1111570163
cask "zed"
mas "Floating", id: 1508833245
cask "font-jetbrains-mono-nerd-font"
mas "Dropover", id: 1355679052
cask "dockdoor"
tap "rafaelswi/menubarusb"
cask "rafaelswi/menubarusb/menubarusb"
cask "garagesale"
cask "jordanbaird-ice"


#==============================================================================
#                       Cloud Storage
#==============================================================================
cask "dropbox"
cask "google-drive"
mas "OneDrive", id: 823766827


#==============================================================================
#                       Data & Backup
#==============================================================================
cask "backblaze"
cask "duplicacy-web-edition"

#==============================================================================
#                       Networking & VPN
#==============================================================================
mas "WireGuard", id: 1451685025
cask "tunnelblick"
cask "wireshark"
cask "angry-ip-scanner"
