# 2023-05-29 Mac Mini 2014
# My list of packages to install on new machines with homebrew

# Assumes installation of homebrew, git, and that the Mac App Store is authenticated.
# Run on new machine from the dev-env repo folder with:
# `caffeinate -disu brew bundle -v; caffeinate -disu brew cleanup; caffeinate -disu brew doctor —-verbose`

# Keep system updated with a service that runs:
# `caffeinate -disu brew bundle -v; caffeinate -disu brew cleanup;

#==============================================================================
#                       Repos
#==============================================================================
tap "homebrew/core"
tap "homebrew/services"
tap "homebrew/cask"
tap "homebrew/bundle"
tap "homebrew/cask-drivers"
tap "homebrew/cask-versions"
tap "homebrew/cask-fonts"
tap "hashicorp/tap"
tap "ttscoff/thelab" # https://brettterpstra.com


brew "mas" # Mac App Store command-line interface
brew "mackup"
mas "1Blocker", id: 1365531024 # always tries to reinstall so comment out after initial install on Mac
mas "Amphetamine", id: 937984704
mas "BBEdit", id: 404009241
mas "Copy 'Em", id: 876540291
mas "Drafts", id: 1435957248
mas "Geekbench 5", id: 1478447657
mas "Speedtest", id: 1153157709
mas "StopTheMadness", id: 1376402589
mas "The Unarchiver", id: 425424353
mas "Hush Nag Blocker", id: 1544743900
mas "Yoink", id: 457622435
mas "Mobile Mouse Server", id: 412814284
mas "Moom", id: 419330170
cask "obsidian"
cask "iterm2"
cask "warp"
cask "1password"
cask "1password-cli"
cask "bettertouchtool"
cask "vlc"
cask "visual-studio-code"
cask "visual-studio-code-insiders"
cask "nova"
cask "mission-control-plus"
cask "firefox"
cask "daisydisk"
cask "backblaze"
cask "betterzip"
cask "forklift"
cask "protonvpn"
cask "transmission"
cask "textexpander"
cask "superduper"
cask "appcleaner"
cask "qlcolorcode" #QuickLook plugin for source code with syntax highlighting.
cask "qlstephen" # QuickLook plugin that lets you view plain text files without a file extension
cask "carbon-copy-cloner"
cask "cheatsheet"
cask "customshortcuts"
cask "hazel"
cask "raycast"
cask "downie"
mas "PopClip", id: 445189367
cask "bunch"
cask "keyboard-maestro"
cask "transmit"
mas "TaskPaper", id: 1090940630
mas "Things", id: 904280696
mas "Disk Speed Test", id: 425264550
mas "Trello", id: 1278508951
mas "MultiMarkdown Composer", id: 1275176220
mas "Expressions", id: 913158085
cask "markdown-service-tools"
cask "tunnelblick"
mas "Due", id: 524373870
mas "Pastel", id: 413897608
mas "ColorSlurp", id: 1287239339
cask "cleanshot"
cask "fig"
brew "python"
brew "pyenv"
brew "node"
brew "nvm"
cask "tableplus" # Current favorite DBMS interface
cask "nteract"
cask "insomnia"
cask "wireshark"
#             CLI
#------------------------------------------------------------------------------
brew "bash"
brew "zsh"
brew "curl"
brew "wget"
brew "grep"
brew "rsync"
brew "git"
brew "git-lfs"
brew "git-delta"
brew "tldr"
brew "thefuck"
brew "wtfutil" #Personal information dashboard for your terminal
brew "cheat"
brew "vim"
brew "tmux" # Terminal multiplexer
brew "neofetch" # Fast, highly customisable system info script
brew "tree" # Display directories as trees (with optional color/HTML output)
brew "htop" #Improved top (interactive process viewer)
brew "nmap" # Port scanning utility for large networks
brew "watch" # Executes a program periodically, showing output fullscreen
brew "watchman" # Watch files and take action when they change
brew "jq" #Lightweight and flexible command-line JSON processor
brew "yq" #Process YAML, JSON, XML, CSV and properties documents from the CLI
brew "jo" #Process YAML, JSON, XML, CSV and properties documents from the CLI
brew "dnstracer" #Trace a chain of DNS servers to the source
brew "netcat" #Utility for managing network connections
brew "openssh"
brew "openssl"
brew "ssh-copy-id"
brew "speedtest-cli"
brew "terminal-notifier" #Send macOS User Notifications from the command-line
brew "alerter" #Send User Alert Notification on macOS from the command-line
brew "pstree" #Show ps output as a tree
brew "p7zip" #7-Zip (high compression file archiver) implementation
brew "dockutil" #Tool for managing dock items
brew "duti" #Select default apps for documents and URL schemes on macOS
brew "7-zip"
brew "lynx" #Text-based web browser
brew "ffmpeg"
brew "glances" #Alternative to top/htop
brew "imagemagick" # Tools and libraries to manipulate images in many formats
brew "pv" #Monitor data's progress through a pipe
brew "aview" #ASCII-art image browser and animation viewer
brew "bat" #Clone of cat(1) with syntax highlighting and Git integration
brew "sd" #Intuitive find & replace CLI
brew "ripgrep" #Search tool like grep and The Silver Searcher
brew "mosh" #Remote terminal application
brew "fzf" #Command-line fuzzy finder written in Go
brew "fd" #Simple, fast and user-friendly alternative to find
brew "exa" #Modern replacement for 'ls'
brew "pidof" #Display the PID number for a given process name
brew "gather-cli" # Readability and Markdown utility for saving web urls and HTML text (Terpstra)
brew "espeak" #Text to speech, software speech synthesizer
brew "cowsay"
brew "shellcheck" # Static analysis and lint tool, for (ba)sh scripts
brew "shfmt" # Autoformat shell script source code
mas "Cardhop", id: 1290358394
mas "Acorn", id: 1547371478
brew "mitmproxy" #Intercept, modify, replay, save HTTP/S traffic
brew "pre-commit"
cask "ngrok" #Reverse proxy, secure introspectable tunnels to localhost
brew "cmake" #Cross-platform make
brew "make" #Cross-platform make
cask "micro-snitch"
cask "little-snitch"
cask "istat-menus"
cask "xbar"
cask "datadog-agent"
cask "docker"
cask "plex-media-server" # Install only for servers
cask "screens-connect"
