# My list of packages to install on new machines with homebrew
# Pull from this list to make a machine-specific Brewfile or just use this file directly

# Assumes installation of homebrew, git, and that the Mac App Store is authenticated.
# Run on new machine from the dev-env repo folder with:
# `caffeinate -disu brew bundle -v; caffeinate -disu brew cleanup; caffeinate -disu brew doctor —-verbose`

# Keep system updated with a service that runs:
# `caffeinate -disu brew bundle -v; caffeinate -disu brew cleanup;

#==============================================================================
#                       Repos
#==============================================================================
tap "homebrew/bundle"
tap "homebrew/services"
tap "homebrew/cask-versions"
tap "homebrew/cask-fonts"
tap "hashicorp/tap"
# https://brettterpstra.com
tap "ttscoff/thelab"
tap "homebrew/core"
tap "homebrew/cask"


#==============================================================================
#                       Core
#==============================================================================
# To install on all machines - servers, personal, dev, etc.
# Mac App Store command-line interface
brew "mas"
brew "mackup"
mas "Amphetamine", id: 937984704
cask "iterm2"
cask "fig"
cask "1password"
mas "1Password for Safari", id: 1569813296
cask "1password-cli"
cask "bettertouchtool"
cask "vlc"
# always tries to reinstall so comment out after initial install on Mac
mas "1Blocker", id: 1365531024
mas "BBEdit", id: 404009241
mas "Copy 'Em", id: 876540291
mas "Drafts", id: 1435957248
cask "geekbench"
mas "Speedtest", id: 1153157709
mas "StopTheMadness", id: 1376402589
mas "The Unarchiver", id: 425424353
mas "Hush", id: 1544743900
mas "Yoink", id: 457622435
mas "Mobile Mouse Server", id: 412814284
mas "Moom", id: 419330170
cask "visual-studio-code"
cask "visual-studio-code-insiders"
cask "mission-control-plus"
cask "firefox"
cask "google-chrome"

cask "betterzip"
cask "forklift"

cask "transmission"
cask "textexpander"
cask "appcleaner"
# QuickLook plugin for source code with syntax highlighting.
cask "qlcolorcode"
# QuickLook plugin that lets you view plain text files without a file extension
cask "qlstephen"
cask "carbon-copy-cloner"
cask "cheatsheet"
cask "customshortcuts"
cask "hazel"
cask "raycast"
cask "downie"
cask "jdownloader"
mas "PopClip", id: 445189367
cask "bunch"
cask "keyboard-maestro"
cask "transmit"
mas "TaskPaper", id: 1090940630
mas "Things", id: 904280696
mas "Trello", id: 1278508951
mas "MultiMarkdown Composer", id: 1275176220
mas "Expressions", id: 913158085
cask "markdown-service-tools"
mas "The Magic Highlighter", id: 1663033087
mas "ColorSlurp", id: 1287239339
mas "Super Agent for Safari", id: 1568262835
cask "cleanshot"
# Current favorite DBMS interface
cask "tableplus"
cask "nteract"
cask "insomnia"
cask "wireshark"
mas "Short Circuit: AI Assistant", id: 1638522784
mas "The Camelizer", id: 1532579087
mas "DuckDuckGo", id: 663592361
cask "obsidian"
mas "Screens", id: 1224268771
cask "typora"
mas "Cardhop", id: 1290358394
mas "Acorn", id: 1547371478
mas "Actions", id: 1586435171
mas "Dark Reader for Safari", id: 1438243180
mas "Vinegar", id: 1591303229
mas "Baking Soda", id: 1601151613
cask "font-menlo-for-powerline"
cask "arc"
cask "cyberduck"
cask "paletro"
cask "signal"
cask "tigervnc-viewer"
mas "Transmit", id: 1436522307
cask "mullvadvpn"
mas "Screens 5", id: 1663047912
mas "Tailscale", id: 1475387142
cask "hookmark"
cask "latest"
#             Shell & Programming Languages
#------------------------------------------------------------------------------
brew "pipx"
brew "bash"
brew "zsh"
brew "ipython"
brew "pyenv"
brew "nvm"
brew "curl"
brew "wget"
brew "grep"
brew "rsync"
brew "git"
brew "git-lfs"
brew "git-delta"
brew "tldr"
brew "thefuck"
# Personal information dashboard for your terminal
brew "wtfutil"
brew "cheat"
brew "vim"
# Terminal multiplexer
brew "tmux"
# Fast, highly customisable system info script
brew "neofetch"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Improved top (interactive process viewer)
brew "htop"
# Port scanning utility for large networks
brew "nmap"
# Executes a program periodically, showing output fullscreen
brew "watch"
# Watch files and take action when they change
brew "watchman"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Process YAML, JSON, XML, CSV and properties documents from the CLI
brew "yq"
# Process YAML, JSON, XML, CSV and properties documents from the CLI
brew "jo"
# Trace a chain of DNS servers to the source
brew "dnstracer"
# Utility for managing network connections
brew "netcat"
brew "openssh"
brew "openssl"
brew "ssh-copy-id"
brew "speedtest-cli"
# Send macOS User Notifications from the command-line
brew "terminal-notifier"
# Send User Alert Notification on macOS from the command-line
brew "alerter"
# Show ps output as a tree
brew "pstree"
# 7-Zip (high compression file archiver) implementation
brew "p7zip"
# Tool for managing dock items
brew "dockutil"
# Select default apps for documents and URL schemes on macOS
brew "duti"
brew "7-zip"
# Text-based web browser
brew "lynx"
brew "ffmpeg"
# Alternative to top/htop
brew "glances"
# Tools and libraries to manipulate images in many formats
brew "imagemagick"
# Monitor data's progress through a pipe
brew "pv"
# ASCII-art image browser and animation viewer
brew "aview"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Intuitive find & replace CLI
brew "sd"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Remote terminal application
brew "mosh"
# Command-line fuzzy finder written in Go
brew "fzf"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Modern replacement for 'ls'
brew "exa"
#Display the PID number for a given process name
brew "pidof"
# Requires full xCode installation. Readability and Markdown utility for saving web urls and HTML text (Terpstra)
brew "gather-cli"
# Text to speech, software speech synthesizer
brew "espeak"
brew "cowsay"
# Static analysis and lint tool, for (ba)sh scripts
brew "shellcheck"
# Autoformat shell script source code
brew "shfmt"
# Intercept, modify, replay, save HTTP/S traffic
brew "mitmproxy"
brew "pre-commit"
# Reverse proxy, secure introspectable tunnels to localhost
cask "ngrok"
# Cross-platform make
brew "cmake"
# Swiss-army knife of markup format conversion
brew "pandoc"
brew "neovim"
brew "pyyaml"
# Record and share your terminal sessions
brew "asciinema"
# Good-lookin' diffs with diff-highlight and more
brew "diff-so-fancy"
# GitHub official CLI tool
brew "gh"
# GIT utilities -- repo summary, repl, changelog population, author commit percentages and more
brew "git-extras"
# Additional GitHub functions for git on the command-line
brew "hub"
# Shell extension to jump to frequently used directories
brew "autojump"
brew "mc"
brew "hurl"
brew "mdless"
brew "w3m"


#==============================================================================
#                       Personal
#==============================================================================
cask "screens-connect"
# For personal machines, in addition to core
cask "balenaetcher"
# Use the non-Mac-App-Store version - it has more features.
cask "daisydisk"
mas "Mactracker", id: 430255202
mas "Deliveries", id: 290986013
mas "Fantastical", id: 975937182
mas "GarageBand", id: 682658836
# always tries to reinstall so comment out after initial install on Mac
mas "Highlights", id: 1498912833
mas "Pastel", id: 413897608
# More of a regular desktop app? Not plex-media-server.
cask "plex"
# More of a TV/10-ft interface? Not plex-media-server.
cask "plex-media-player"
mas "iMovie", id: 408981434
mas "Play", id: 1596506190
mas "Keynote", id: 409183694
mas "Kindle", id: 405399194
mas "Notability", id: 360593530
mas "Numbers", id: 409203825
mas "OmniOutliner", id: 1142578772
mas "Pages", id: 409201541
mas "Keynote", id: 409183694
mas "Scapple", id: 568020055
mas "Noizio", id: 928871589
# always tries to reinstall so comment out after initial install on Mac
mas "Prime Video", id: 545519333
cask "bartender"
cask "foldingtext"
cask "xee"
cask "inkscape"
cask "iina"
cask "gimp"
cask "swiftdefaultappsprefpane"
cask "google-earth-pro"
cask "handbrake"
cask "audacity"
mas "Forecast Bar", id: 982710545

mas "MusicBar", id: 6447295161
cask "music-bar"
cask "drawio"
cask "notion"
mas "Notion Web Clipper", id: 1559269364
cask "fastscripts"
mas "Slack", id: 803453959
mas "Paprika Recipe Manager 3", id: 1303222628
mas "WriteRoom", id: 417967324
mas "Simplenote", id: 692867256
mas "Poolsuite FM", id: 1514817810
mas "Dark Noise", id: 1465439395
cask "discord"
cask "tinderbox"
cask "default-folder-x"
mas "Backtrack", id: 1477089520
# Install failed
mas "Overcast", id: 888422857
cask "zotero"
cask "bike"
# dependency for Terpstra's SearchLink
brew "aspell"
cask "karabiner-elements"
mas "Data Jar", id: 1453273600
mas "DuckDuckGo Privacy for Safari", id: 1482920575
mas "MacFamilyTree 10", id: 1567970985
mas "FamilySearch Tree", id: 885982973
mas "Drone Buddy: Fly Drone Safely", id: 992303145
mas "Home Assistant", id: 1099568401
mas "Save to Reader", id: 1640236961
mas "Lensa", id: 1436732536
mas "Fotor - Photo Editor, Designer", id: 503039729
mas "Timery", id: 1425368544
mas "Toggl Track", id: 1291898086
mas "Actions for Obsidian", id: 1659667937
mas "Portal", id: 1436994560
mas "Streaks", id: 963034692
mas "Banktivity", id: 1480779512
cask "logitech-g-hub"
cask "micro-snitch"
cask "little-snitch"
mas "Flighty - Live Flight Tracker", id: 1358823008
mas "Battery Health", id: 490192174
mas "Disk Diag", id: 672206759
mas "Super Agent", id: 1568262835
brew "sevenzip"
mas "AllMyBatteries", id: 1621263412
cask "element"
cask "firefox-developer-edition"
cask "fleet"
brew "ttscoff/thelab/gather-cli"
mas "Kindle", id: 302584613
mas "Ice Cubes", id: 6444915884
mas "MarkDownload - Markdown Web Clipper", id: 1554029832
cask "sirimote"
mas "Meshtastic", id: 1586432531
cask "mullvad-browser"
cask "qgis"
cask "dropzone"
mas "Actions For Obsidian", id: 1659667937
#             Additional Shell
#------------------------------------------------------------------------------
brew "lolcat"
brew "cmatrix"
brew "fortune"
brew "asciiquarium"
brew "ponysay"


#==============================================================================
#                       Optional/Depends...
#==============================================================================
# Optional packages
cask "screens-connect"
mas "Be Focused Pro", id: 961632517
mas "Pluralsight", id: 431748264
mas "Disk Speed Test", id: 425264550
# GUI for homebrew
cask "cakebrew"
# Noise cancelling application - helpful for video calls in a coffee shop, e.g.
cask "krisp"
mas "Flighty", id: 1358823008
cask "dropbox"
cask "google-drive"
brew "rclone"
brew "gitlab-runner"
mas "Microsoft Word", id: 462054704
mas "Microsoft Excel", id: 462058435
mas "Microsoft PowerPoint", id: 462062816
mas "Save to Raindrop.io", id: 1549370672


#==============================================================================
#                       Development & Cloud
#==============================================================================
# For personal machines that might be used for development
cask "dash"
cask "figma"
brew "screen"
brew "hashicorp/tap/vault"
brew "vault"
brew "jupyterlab"
# GTK+ dialog boxes for the command-line
brew "zenity"
mas "System Designer", id: 1102494854
# Text-based UI library
brew "ncurses"
brew "go-task"
# For pycharm, IntelliJ, etc.
cask "jetbrains-toolbox"
#             Git
#------------------------------------------------------------------------------
cask "github"
cask "gitkraken"
cask "gitup"
cask "tower"
cask "sourcetree"
#             APIs
#------------------------------------------------------------------------------
cask "postman"
brew "newman"
brew "httpie"
cask "http-toolkit"
cask "httpie"
cask "postman-cli"
brew "graphql-cli"

#             Servers, Containers, Docker, & Virtualization
#------------------------------------------------------------------------------
cask "docker"
brew "podman"
brew "whalebrew"
brew "hashicorp/tap/packer"
brew "packer"
# Failed to install - no Apple Silicon? 2023-06-03
cask "vagrant"
# homebrew fails to install - on Apple Silicon 2023-06-03
cask "virtualbox"
#             Cloud, Web, & Kubernetes
#------------------------------------------------------------------------------
brew "netlify-cli"
# Zero Trust
mas "Twingate", id: 1501592214
# AWS
brew "awscli"
brew "eksctl"
# GCP
brew "google-cloud-sdk"
brew "firebase-cli"
# Kubernetes
brew "kubernetes-cli"
brew "minikube"
brew "helm"
#             Terraform & Dependencies
#------------------------------------------------------------------------------
# update warns due to tfenv managing the terraform binary
brew "hashicorp/tap/terraform"
brew "terraform"
brew "tfenv"
brew "terraform-docs"
brew "terragrunt"
brew "tflint"
brew "tfsec"
brew "coreutils"
brew "checkov"
brew "terrascan"
brew "infracost"
#             Data
#------------------------------------------------------------------------------
cask "dbvisualizer"
# Postgres
brew "postgresql"
# SQLite
brew "sqlite"
cask "sqlitestudio"
cask "db-browser-for-sqlite"
# MongoDB
tap "mongodb/brew"
cask "robo-3t"
cask "mongodb-compass"
brew "mongodb/brew/mongodb-community"


cask "lm-studio"
brew "ansible"
brew "grafana"
#             Security
#-------------------------------------------------------------------------------
brew "semgrep"
tap "snyk/tap"
brew "snyk/tap/snyk"
#             IOT, Microelectronics, Embedded, Radio, SBCs, & Raspberry Pi
#------------------------------------------------------------------------------
cask "raspberry-pi-imager"
cask "arduino-ide"
#             Python
#------------------------------------------------------------------------------
brew "virtualenv"
brew "black"
#             JavaScript
#-----------------------------------------------------------------------------
brew "yarn"
brew "typescript"
brew "gatsby-cli"
brew "angular-cli"
