# My list of packages to install on new machines with homebrew
# Pull from this list to make a machine-specific Brewfile or just use this file directly

# Assumes installation of homebrew, git, and that the Mac App Store is authenticated.
# Run on new machine from the dev-env repo folder with:
# `caffeinate -disu brew bundle -v; caffeinate -disu brew cleanup; caffeinate -disu brew doctor —-verbose`

# Keep system updated with a service that runs:
# `caffeinate -disu brew bundle -v; caffeinate -disu brew cleanup;

#==============================================================================
#                       Repos
#==============================================================================
tap "homebrew/core"
tap "homebrew/services"
tap "homebrew/cask"
tap "homebrew/bundle"
tap "homebrew/cask-drivers"
tap "homebrew/cask-versions"
tap "homebrew/cask-fonts"
tap "hashicorp/tap"
tap "ttscoff/thelab" # https://brettterpstra.com


#==============================================================================
#                       Core Packages
#==============================================================================
# To install on all machines - servers, personal, dev, etc.
brew "mas" # Mac App Store command-line interface
brew "mackup"
mas "Amphetamine", id: 937984704
cask "iterm2"
cask "warp"
cask "fig"
cask "1password"
cask "1password-cli"
cask "bettertouchtool"
cask "vlc"
mas "1Blocker", id: 1365531024 # always tries to reinstall so comment out after initial install on Mac
mas "BBEdit", id: 404009241
mas "Copy 'Em", id: 876540291
mas "Drafts", id: 1435957248
mas "Geekbench 5", id: 1478447657
mas "Speedtest", id: 1153157709
mas "StopTheMadness", id: 1376402589
mas "The Unarchiver", id: 425424353
mas "Hush Nag Blocker", id: 1544743900
mas "Yoink", id: 457622435
mas "Mobile Mouse Server", id: 412814284
mas "Moom", id: 419330170
cask "visual-studio-code"
cask "visual-studio-code-insiders"
cask "nova"
cask "mission-control-plus"
cask "firefox"
cask "backblaze"
cask "betterzip"
cask "forklift"
cask "protonvpn"
cask "transmission"
cask "textexpander"
cask "superduper"
cask "appcleaner"
cask "qlcolorcode" #QuickLook plugin for source code with syntax highlighting.
cask "qlstephen" # QuickLook plugin that lets you view plain text files without a file extension
cask "carbon-copy-cloner"
cask "cheatsheet"
cask "customshortcuts"
cask "hazel"
cask "raycast"
cask "alfred"
cask "downie"
mas "PopClip", id: 445189367
cask "bunch"
cask "keyboard-maestro"
cask "transmit"
mas "TaskPaper", id: 1090940630
mas "Things", id: 904280696
mas "Trello", id: 1278508951
mas "MultiMarkdown Composer", id: 1275176220
mas "Expressions", id: 913158085
cask "markdown-service-tools"
cask "tunnelblick"
mas "Due", id: 524373870
mas "The Magic Highlighter", id: 1663033087
mas "ColorSlurp", id: 1287239339
mas "Super Agent for Safari", id: 1568262835
cask "cleanshot"
cask "tableplus" # Current favorite DBMS interface
cask "nteract"
cask "insomnia"
cask "wireshark"
mas "Short Circuit: AI Assistant", id: 1638522784
mas "The Camelizer", id: 1532579087
mas "DuckDuckGo", id: 663592361
cask "obsidian"
mas "Screens", id: 1224268771
cask "typora"
mas "Cardhop", id: 1290358394
mas "Acorn", id: 1547371478
mas "Actions", id: 1586435171
mas "Dark Reader for Safari", id: 1438243180
cask "hook"
mas "Vinegar - Tube Cleaner", id: 1591303229
mas "Baking Soda - Tube Cleaner", id: 1601151613
#             Fonts
#------------------------------------------------------------------------------
cask "font-menlo-for-powerline"
#             CLI
#------------------------------------------------------------------------------
brew "bash"
brew "zsh"
brew "python"
brew "pyenv"
brew "node"
brew "nvm"
brew "curl"
brew "wget"
brew "grep"
brew "rsync"
brew "git"
brew "git-lfs"
brew "git-delta"
brew "tldr"
brew "thefuck"
brew "wtfutil" #Personal information dashboard for your terminal
brew "cheat"
brew "vim"
brew "tmux" # Terminal multiplexer
brew "neofetch" # Fast, highly customisable system info script
brew "tree" # Display directories as trees (with optional color/HTML output)
brew "htop" #Improved top (interactive process viewer)
brew "nmap" # Port scanning utility for large networks
brew "watch" # Executes a program periodically, showing output fullscreen
brew "watchman" # Watch files and take action when they change
brew "jq" #Lightweight and flexible command-line JSON processor
brew "yq" #Process YAML, JSON, XML, CSV and properties documents from the CLI
brew "jo" #Process YAML, JSON, XML, CSV and properties documents from the CLI
brew "dnstracer" #Trace a chain of DNS servers to the source
brew "netcat" #Utility for managing network connections
brew "openssh"
brew "openssl"
brew "ssh-copy-id"
brew "speedtest-cli"
brew "terminal-notifier" #Send macOS User Notifications from the command-line
brew "alerter" #Send User Alert Notification on macOS from the command-line
brew "pstree" #Show ps output as a tree
brew "p7zip" #7-Zip (high compression file archiver) implementation
brew "dockutil" #Tool for managing dock items
brew "duti" #Select default apps for documents and URL schemes on macOS
brew "7-zip"
brew "lynx" #Text-based web browser
brew "ffmpeg"
brew "glances" #Alternative to top/htop
brew "imagemagick" # Tools and libraries to manipulate images in many formats
brew "pv" #Monitor data's progress through a pipe
brew "aview" #ASCII-art image browser and animation viewer
brew "bat" #Clone of cat(1) with syntax highlighting and Git integration
brew "sd" #Intuitive find & replace CLI
brew "ripgrep" #Search tool like grep and The Silver Searcher
brew "mosh" #Remote terminal application
brew "fzf" #Command-line fuzzy finder written in Go
brew "fd" #Simple, fast and user-friendly alternative to find
brew "exa" #Modern replacement for 'ls'
brew "pidof" #Display the PID number for a given process name
brew "gather-cli" # Readability and Markdown utility for saving web urls and HTML text (Terpstra)
brew "espeak" #Text to speech, software speech synthesizer
brew "cowsay"
brew "shellcheck" # Static analysis and lint tool, for (ba)sh scripts
brew "shfmt" # Autoformat shell script source code
brew "mitmproxy" #Intercept, modify, replay, save HTTP/S traffic
brew "pre-commit"
cask "ngrok" #Reverse proxy, secure introspectable tunnels to localhost
brew "cmake" #Cross-platform make
brew "ipython"
brew "pandoc" # Swiss-army knife of markup format conversion
brew "neovim"
brew "pyyaml"
brew "asciinema" #Record and share your terminal sessions
brew "diff-so-fancy" #Good-lookin' diffs with diff-highlight and more
brew "gh" #GitHub official CLI tool
brew "git-extras" #GIT utilities -- repo summary, repl, changelog population, author commit percentages and more
brew "hub" #Additional GitHub functions for git on the command-line
brew "autojump" #Shell extension to jump to frequently used directories


#==============================================================================
#                       Personal Packages
#==============================================================================
# For personal machines, in addition to core
cask "balenaetcher"
cask "daisydisk"
mas "Mactracker", id: 430255202
mas "Deliveries", id: 290986013
mas "Fantastical", id: 975937182
mas "GarageBand", id: 682658836
mas "Highlights", id: 1498912833 # always tries to reinstall so comment out after initial install on Mac
mas "Pastel", id: 413897608
cask "plex" # More of a regular desktop app? Not plex-media-server.
cask "plex-media-player" # More of a TV/10-ft interface? Not plex-media-server.
mas "iMovie", id: 408981434
mas "Play", id: 1596506190
mas "Keynote", id: 409183694
mas "Kindle", id: 405399194
mas "Notability", id: 360593530
mas "Numbers", id: 409203825
mas "OmniOutliner", id: 1142578772
mas "Pages", id: 409201541
mas "Reeder", id: 880001334
mas "Scapple", id: 568020055
mas "Noizio", id: 928871589
mas "Amazon Prime Video", id: 545519333 # always tries to reinstall so comment out after initial install on Mac
cask "bartender"
cask "google-chrome"
cask "foldingtext"
cask "xee"
cask "inkscape"
cask "iina"
cask "gimp"
cask "swiftdefaultappsprefpane"
cask "google-earth-pro"
cask "handbrake"
cask "audacity"
cask "permute"
cask "unite"
cask "path-finder"
cask "batteries"
cask "houdahspot"
mas "Forecast Bar", id: 982710545
cask "duplicacy-web-edition"
cask "music-bar"
cask "drawio"
cask "notion"
cask "fastscripts"
mas "Slack", id: 803453959
mas "Paprika Recipe Manager 3", id: 1303222628
mas "WriteRoom", id: 417967324
mas "Simplenote", id: 692867256
mas "Poolsuite FM", id: 1514817810
cask "discord"
cask "tinderbox"
cask "default-folder-x"
mas "Backtrack - Record Past Audio", id: 1477089520
mas "Overcast", id: 888422857 # Install failed
mas "Apollo", id: 979274575 # Install failed
cask "choosy"
cask "zotero"
cask "bike"
brew "aspell" # dependency for Terpstra's SearchLink
cask "karabiner-elements"
mas "Data Jar", id: 1453273600
mas "DuckDuckGo Privacy for Safari", id: 1482920575
mas "Fakespot for Safari", id: 1592541616
mas "MacFamilyTree 10", id: 1567970985
mas "FamilySearch Tree", id: 885982973
mas "Drone Buddy: Fly Drone Safely", id: 992303145
mas "Home Assistant", id: 1099568401
mas "Pretty OK - Meh Daily Deal", id: 960524321
mas "Save to Reader", id: 1640236961
mas "Session - Pomodoro Focus Timer", id: 1521432881
mas "Shortform", id: 1489472007
mas "Lensa AI: photo editor, video", id: 1436732536
mas "Fotor - Photo Editor, Designer", id: 503039729
mas "Timery for Toggl", id: 1425368544
mas "Toggl Track: Hours & Time Log", id: 1291898086
mas "Actions for Obsidian", id: 1659667937
mas "Portal - Immersive Escapes", id: 1436994560
mas "Streaks", id: 963034692
mas "Elmedia Video Player", id: 1044549675
mas "Banktivity", id: 1480779512
cask "logitech-g-hub"
cask "micro-snitch"
cask "little-snitch"
mas "Flighty - Live Flight Tracker", id: 1358823008
mas "Battery Health - Monitor Stats", id: 490192174
mas "Disk Diag", id: 672206759
cask "onyx"
#             Other Fonts
#------------------------------------------------------------------------------
cask "font-hack-nerd-font"
cask "font-inconsolata-for-powerline"
#             Fun CLI
#------------------------------------------------------------------------------
brew "lolcat"
brew "cmatrix"
brew "fortune"
brew "asciiquarium"
brew "ponysay"


#==============================================================================
#                       Optional Packages
#==============================================================================
# Optional packages
cask "zoom"
cask "skype"
mas "Spark", id: 1176895641
cask "istat-menus"
cask "xbar"
mas "Delicious Library", id: 635124250
mas "WireGuard", id: 1451685025
mas "Twitter", id: 1482454543
mas "Type2Phone", id: 472717129
cask "google-drive"
cask "obs"
mas "Studies", id: 1071676469
mas "Be Focused Pro", id: 961632517
mas "Omnivore: Read-it-later", id: 1564031042
mas "Pluralsight", id: 431748264
mas "Wavelength Messenger", id: 1584865627
mas "Friendly Streaming Browser", id: 553245401
mas "Ivory for Mastodon by Tapbots", id: 6444602274
mas "Front and Center", id: 1493996622
mas "Aquarium Live HD screensaver", id: 462563503
mas "Fireplace Live HD", id: 468630933
mas "Koi Pond 3D Lite", id: 534867956
mas "Blackmagic Disk Speed Test", id: 425264550
cask "scrivener"
cask "adobe-creative-cloud"
cask "aerial" #Apple TV Aerial screensaver
cask "authy" # 2FA from Twilio
cask "cakebrew" # GUI for homebrew
cask "krisp" # Noise cancelling application - helpful for video calls in a coffee shop, e.g.

#==============================================================================
#                       Additional Developer Packages
#==============================================================================
# For personal machines that might be used for development
cask "postman"
cask "dash"
cask "sourcetree"
brew "go"
brew "ruby"
brew "ansible"
brew "screen"
brew "jupyterlab"
brew "zenity" # GTK+ dialog boxes for the command-line
mas "Xcode", id: 497799835 
mas "System Designer", id: 1102494854
mas "Datadog", id: 1391380318
mas "TestFlight", id: 899247664
brew "ncurses" #Text-based UI library
brew "jmeter"
brew "selenium-server"
cask "teacode"
cask "datadog-agent"
cask "royal-tsx"
cask "figma"
brew "grafana"
#             Text Editors & IDEs
#------------------------------------------------------------------------------
cask "vscodium" #Much slower than VS Code and Insiders
cask "jetbrains-toolbox" # For pycharm, IntelliJ, etc.
cask "mu-editor"
cask "textmate"
#             Git
#------------------------------------------------------------------------------
cask "github"
cask "gitkraken"
cask "gitup"
cask "tower"
#             Servers & Virtualization
#------------------------------------------------------------------------------
cask "docker"
brew "hashicorp/tap/packer"
brew "whalebrew"
brew "vagrant" # Failed to install - no Apple Silicon? 2022-03-27
cask "virtualbox" # homebrew fails to install - no Apple Silicon? 2022-03-27
brew "nginx"
brew "httpd"
brew "lighttpd"
brew "jenkins"
#             Cloud & Kubernetes
#------------------------------------------------------------------------------
brew "awscli"
brew "eksctl"
brew "google-cloud-sdk"
brew "firebase-cli"
brew "kubernetes-cli"
brew "minikube"
brew "helm"
brew "netlify-cli"
#             Terraform & Dependencies
#------------------------------------------------------------------------------
brew "hashicorp/tap/terraform" #update warns due to tfenv managing the terraform binary so comment out for updateMac.sh
brew "tfenv"
brew "terraform-docs"
brew "terragrunt"
brew "tflint"
brew "tfsec"
brew "coreutils"
brew "checkov"
brew "terrascan"
brew "infracost"

#             Databases
#------------------------------------------------------------------------------
brew "postgresql"
brew "mysql"
cask "mysqlworkbench"
brew "sqlite"
cask "sqlitestudio"
tap "mongodb/brew"
cask "robo-3t"
cask "mongodb-compass"
brew "mongodb-community@5.0"
cask "db-browser-for-sqlite"
cask "mamp"
cask "dbvisualizer"
#             Java
#------------------------------------------------------------------------------
brew "openjdk"
brew "gradle"
brew "maven"
#             JavaScript
#-----------------------------------------------------------------------------
brew "yarn"
brew "typescript"
brew "gatsby-cli"
brew "angular-cli"

#             Python
#------------------------------------------------------------------------------
#	pyenv dependencies?
# brew "openssl" # For pyenv & its dependencies?
# brew "readline" # For pyenv & its dependencies?
# brew "sqlite3" # For pyenv & its dependencies?
# brew "xz" # For pyenv & its dependencies?
# brew "zlib" # For pyenv & its dependencies?

#             Security
#-------------------------------------------------------------------------------
brew "semgrep"
tap "snyk/tap"
brew "snyk"


#==============================================================================
#                       Work
#==============================================================================
mas "Jira Cloud by Atlassian", id: 1475897096
mas "Microsoft Word", id: 462054704
mas "Microsoft Excel", id: 462058435
mas "Microsoft PowerPoint", id: 462062816
mas "Microsoft Outlook", id: 985367838
mas "Microsoft OneNote", id: 784801555
mas "Microsoft OneDrive", id: 823766827
mas "Microsoft Remote Desktop", id: 1295203466
cask "microsoft-teams"
mas "LastPass Password Manager", id: 926036361


#==============================================================================
#                       Additional Games Packages
#==============================================================================
# For personal machines that might be used for games
cask "steam"
mas "Steam Link", id: 1246969117
cask "battle-net" # doesn't install right now - 12-05-2021
cask "dolphin"
cask "openemu"
cask "twitch"


#==============================================================================
#                       Optional Server Packages
#==============================================================================
# For servers, depending on type
cask "plex-media-server" # Install only for servers
cask "screens-connect"


#==============================================================================
#                       Archive
#==============================================================================
# cask "brave-browser"
# cask "vivaldi"
# mas "GoodNotes", id: 1444383602
# mas "com.apptorium.Workspaces", id: 1219826448
# brew "fish" - using zsh, oh-mh-zsh, fig, etc. for now
# brew "telnet" # Insecure, don't install unless needed, and then uninstall
# cask "google-chat"
# cask "pycharm-ce" # use JetBrains Toolbox instead
# cask "intellij-idea-ce" # use JetBrains Toolbox instead
# cask "xampp" # mamp is better than xampp
# cask "dropbox" # needs to install first. So, easier to just do it manually.
# cask "launchbar" #Trying raycast
# cask "razer-synapse" # too buggy 
# mas "Magnet", id: 441258766 # Using moom instead
# cask "mosaic" # Using moom instead
# mas "DevUtils", id: 1533756032 # Costs money
# mas "quiver", id: 866773894 # Using obsidian and then maybe dendron
# mas "CotEditor", id: 1024640650
# cask "fluid" # for Google Voice or any other webapps I want as local apps (Using Unite now)
# cask "hyper" # Use Warp and iTerm instead
# cask "chromium"
# mas "Honey for Safari", id: 1472777122 # always tries to reinstall so comment out after initial install on Mac
# cask "sublime-text" # Haven't used in years - VS Code, Insider's, Nova, BBEdit